In [1]:
import os
os.listdir()

['.ipynb_checkpoints',
 'supermarkets.json',
 'supermarkets.xlsx',
 'Untitled.ipynb']

In [2]:
import pandas

In [7]:
df1=pandas.read_csv("supermarkets.csv")
df1.set_index("ID")

,Lead,Title,Phone,Notes
ID,,,,
1,Jim Grayson,Senior Manager,(555)761-2385,"Spoke Tuesday, he's interested"
2,Prescilla Winston,Development Director,(555)218-3981,said to call again next week
3,Melissa Potter,Head of Accounts,(555)791-3471,"Not interested, gave referral"

In [8]:
df1.shape

(3, 5)

In [10]:
df2=pandas.read_json("supermarkets.json")
df2.set_index("ID")

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [12]:
df3=pandas.read_excel("supermarkets.xlsx")
df3.set_index("ID")

,Address,City,State,Country,Supermarket,Number of Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Walmart,20
3,332 Hill St,San Francisco,California,USA,game,15
4,3995 23rd St,San Francisco,CA 94114,USA,Toys-R-Us,35
5,1056 Sanchez St,San Francisco,California,USA,Nike,6
6,551 Alvarado St,San Francisco,CA 94114,USA,Compton,9

In [16]:
df7=pandas.read_json("http://pythonhow.com/supermarkets.json")
df7=df7.set_index("ID")
df7

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [22]:
df7.iloc[1:4, 0:4]

           Address           City             State Country
ID
2   735 Dolores St  San Francisco          CA 94119     USA
3      332 Hill St  San Francisco  California 94114     USA
4     3995 23rd St  San Francisco          CA 94114     USA

In [ ]:
#The above is position base indexing.

In [ ]:
#The below shows how to query specific data details. Which brings errors the df7.ix[3,5]

In [27]:
from geopy.geocoders import Nominatim

In [29]:
nom=Nominatim(scheme="http")

<ipython-input-29-63c6ef2a0fcd>:1: DeprecationWarning: Using Nominatim with the default "geopy/1.21.0" `user_agent` is strongly discouraged, as it violates Nominatim's ToS https://operations.osmfoundation.org/policies/nominatim/ and may possibly cause 403 and 429 HTTP errors. Please specify a custom `user_agent` with `Nominatim(user_agent="my-application")` or by overriding the default `user_agent`: `geopy.geocoders.options.default_user_agent = "my-application"`. In geopy 2.0 this will become an exception.
  nom=Nominatim()

In [30]:
nom.geocode("3995 23rd St, San Francisco, CA 94114")

Location(3995, 23rd Street, Noe Valley, San Francisco, San Francisco City and County, California, 94114, United States of America, (37.7529648, -122.4317141, 0.0))